#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_sql_container.relying_party_oidc_client_configs will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "relying_party_oidc_client_configs" {
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlDatabases/rp/containers/oidc-client-configs"
        name                  = "oidc-client-configs"
        # (8 unchanged attributes hidden)

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          + excluded_path {
              + path = "/\"_etag\"/?"
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.storage.azurerm_storage_container.event_sc will be created
  + resource "azurerm_storage_container" "event_sc" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "fims-event-blob"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "iopfimseventst"
    }

  # module.storage.azurerm_storage_queue.access_queue will be created
  + resource "azurerm_storage_queue" "access_queue" {
      + id                   = (known after apply)
      + name                 = "access-queue"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopfimsst"
    }

  # module.storage.azurerm_storage_queue.export_queue will be created
  + resource "azurerm_storage_queue" "export_queue" {
      + id                   = (known after apply)
      + name                 = "export-queue"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopfimsst"
    }

  # module.cosmos.module.comsosdb_sql_container_user_accesses.azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "io-p-fims-cosmos"
      + database_name       = "op"
      + default_ttl         = -1
      + id                  = (known after apply)
      + name                = "accesses"
      + partition_key_kind  = "Hash"
      + partition_key_path  = "/fiscalCode"
      + partition_key_paths = (known after apply)
      + resource_group_name = "io-p-fims-rg"
      + throughput          = (known after apply)
    }

  # module.cosmos.module.comsosdb_sql_container_user_export_requests.azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "io-p-fims-cosmos"
      + database_name       = "op"
      + default_ttl         = -1
      + id                  = (known after apply)
      + name                = "export-requests"
      + partition_key_kind  = "Hash"
      + partition_key_path  = "/fiscalCode"
      + partition_key_paths = (known after apply)
      + resource_group_name = "io-p-fims-rg"
      + throughput          = (known after apply)
    }

  # module.cosmos.module.cosmosdb_database_user.azurerm_cosmosdb_sql_database.this will be created
  + resource "azurerm_cosmosdb_sql_database" "this" {
      + account_name        = "io-p-fims-cosmos"
      + id                  = (known after apply)
      + name                = "user"
      + resource_group_name = "io-p-fims-rg"
      + throughput          = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cosmos.azurerm_cosmosdb_sql_container.relying_party_oidc_client_configs,
  on ../_modules/cosmos/cosmos_database_rp.tf line 15, in resource "azurerm_cosmosdb_sql_container" "relying_party_oidc_client_configs":
  15:   partition_key_path    = "/institutionId"

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

(and 17 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmos.cosmosdb_account_fims/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
